{
    "format": "layers-model",
    "generatedBy": "keras v2.8.0",
    "convertedBy": "TensorFlow.js Converter v3.15.0",
    "modelTopology": {
      "keras_version": "2.8.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [null, null, 3],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "conv1d_input"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d",
                "trainable": true,
                "batch_input_shape": [null, null, 3],
                "dtype": "float32",
                "filters": 48,
                "kernel_size": [5],
                "strides": [1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [5],
                "strides": [1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_2",
                "trainable": true,
                "dtype": "float32",
                "filters": 96,
                "kernel_size": [3],
                "strides": [1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": { "gain": 1.0, "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 20,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        }
      },
      "training_config": {
        "loss": "sparse_categorical_crossentropy",
        "metrics": [
          [
            {
              "class_name": "MeanMetricWrapper",
              "config": {
                "name": "accuracy",
                "dtype": "float32",
                "fn": "sparse_categorical_accuracy"
              }
            }
          ]
        ],
        "weighted_metrics": null,
        "loss_weights": null,
        "optimizer_config": {
          "class_name": "Adam",
          "config": {
            "name": "Adam",
            "learning_rate": 0.0010000000474974513,
            "decay": 0.0,
            "beta_1": 0.8999999761581421,
            "beta_2": 0.9990000128746033,
            "epsilon": 1e-7,
            "amsgrad": false
          }
        }
      }
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          { "name": "conv1d/kernel", "shape": [5, 3, 48], "dtype": "float32" },
          { "name": "conv1d/bias", "shape": [48], "dtype": "float32" },
          { "name": "conv1d_1/kernel", "shape": [5, 48, 64], "dtype": "float32" },
          { "name": "conv1d_1/bias", "shape": [64], "dtype": "float32" },
          { "name": "conv1d_2/kernel", "shape": [3, 64, 96], "dtype": "float32" },
          { "name": "conv1d_2/bias", "shape": [96], "dtype": "float32" },
          { "name": "dense/kernel", "shape": [256, 20], "dtype": "float32" },
          { "name": "dense/bias", "shape": [20], "dtype": "float32" },
          {
            "name": "lstm/lstm_cell/kernel",
            "shape": [96, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm/lstm_cell/recurrent_kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          { "name": "lstm/lstm_cell/bias", "shape": [1024], "dtype": "float32" }
        ]
      }
    ]
  }
  